In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df = pd.read_csv("data.txt",delim_whitespace=True)

In [3]:
df.describe()

             cat1        num1        num2         tgt
count  625.000000  625.000000  625.000000  625.000000
mean     9.552000    0.993600    0.465600  206.302400
std      5.180177    0.820388    0.550729  231.614117
min      1.000000    0.000000    0.000000    0.000000
25%      5.000000    0.000000    0.000000   21.000000
50%     10.000000    1.000000    0.250000  118.000000
75%     14.000000    2.000000    0.750000  311.000000
max     18.000000    2.000000    2.000000  961.000000

In [12]:
import random
random.randint(0,9)

1

In [18]:
txt = "ABCDEFGHIJ"
df.loc[:,'cat1'] = [txt[random.randint(0,9)] for i in range(len(df))]
df.drop(columns='cat2',inplace=True)

In [32]:
df.loc[:,'tgt'] = [ df.tgt.iloc[i] * abs(ord(df.cat1.iloc[i]))*0.1    for i in range(len(df))]

In [33]:
df[['num1','num2','tgt']].corr()

          num1      num2       tgt
num1  1.000000  0.696493  0.161254
num2  0.696493  1.000000 -0.092810
tgt   0.161254 -0.092810  1.000000

In [37]:
with open('data.txt', 'w') as f: df.to_string(f, col_space=10,index=False)

In [36]:
df

    cat1  num1   num2       tgt
0      J   2.0  0.750  16208.96
1      J   2.0  0.750  21739.72
2      F   1.0  0.375  17640.00
3      A   0.0  0.000  12675.00
4      A   0.0  0.000  13773.50
..   ...   ...    ...       ...
620    B   2.0  0.000   8102.16
621    A   1.0  0.000   4267.25
622    F   0.0  0.000   9408.00
623    H   1.0  0.000   4613.76
624    H   1.0  0.000   3784.32

[625 rows x 4 columns]